Repository: DragonJoker/Castor3D
Catalog: internationalisation/CastorViewer/po/*/CastorViewer.po
Languages: fr

source: Can't open a scene file : empty file name.
fr: Impossible d'ouvrir le fichier de scène : le chemin du fichier est vide.

source: Can't open a scene file : no engine loaded.
fr: Impossible d'ouvrir le fichier de scène : le moteur n'est pas chargé.

source: Objects
fr: Objets

source: Errors
fr: Erreurs

source: Debug
fr: Debogage

source: Scene
fr: Scènes

source: Loading toolbar
fr: Chargement de la toolbar

source: Load Scene
fr: Charger une scène

source: Open a new scene
fr: Ouvre une nouvelle scène

source: Export Scene
fr: Export de scène

source: Export the current scene
fr: Exporte la scène courante

source: Display logs
fr: Afficher logs

source: Lists
fr: Listes

source: Display lists
fr: Afficher listes

source: Snapshot
fr: Capture d'écran

source: Take a snapshot
fr: Fait une capture d'écran

source: Record
fr: Enregistrer

source: Record a video
fr: Enregistre une vidéo

source: Stop
fr: Arrêter

source: Stop recording
fr: Arrête l'enregistrement

source: Exit
fr: Quitter

source: File
fr: Fichier

source: Tabs
fr: Onglets

source: All supported image types
fr: Tous les types de fichiers supportés

source: BITMAP image
fr: Image BITMAP

source: GIF image
fr: Image GIF

source: JPEG image
fr: Image JPEG

source: PNG image
fr: Image PNG

source: Please choose an image file name
fr: Choisissez un nom de fichier image

source: Castor3D scene files
fr: Fichiers de scène Castor3D

source: Castor3D scene file
fr: Fichiers de scène Castor3D

source: Zip archive
fr: Archive zip

source: Open a scene
fr: Ouvrir une scène

source: Export
fr: Exposant

source: Castor3D scene
fr: Scène Castor3D

source: Export the scene
fr: Exporter la scène

source: Scene export completed
fr: Export de la scène terminé

source: Scene export failed:
fr: Export de la scène échoué :

source: Error
fr: Erreur

source: No scene Loaded.
fr: Aucune scène chargée.

source: Failed to parse the scene file, with following error:
fr: Echec de l'analyse du fichier de scène texte, avec l'erreur suivante :

source: Scene file doesn't exist :
fr: Le fichier de scène n'existe pas :

source: Scene file couldn't be loaded:
fr: Le fichier de scène n'a pas pu être chargé :

source: New...
fr: Créer...

source: View
fr: Vue

source: Width
fr: Largeur

source: Height
fr: Hauteur

source: Left
fr: Gauche

source: Top
fr: Haut

source: Right
fr: Droite

source: Bottom
fr: Bas

source: Validate
fr: Valider

source: Cancel
fr: Annuler

source: Animated Objects Group:
fr: Groupes d'objets animés :

source: Animated Object:
fr: Objet animé :

source: Start at
fr: Début à

source: Stop at
fr: Arrêter

source: Speed
fr: Vitesse

source: Looped
fr: Boucle

source: State
fr: Etat

source: Play
fr: Lire

source: Equirectangular Image
fr: Image équirectangulaire

source: Equirectangular Dimensions
fr: Dimensions équirectangulaire

source: Cross Image
fr: Image croix

source: Left Image
fr: Image de gauche

source: Right Image
fr: Image de droite

source: Top Image
fr: Image du haut

source: Bottom Image
fr: Image du bas

source: Front Image
fr: Image de l'avant

source: Back Image
fr: Image de l'arrière

source: Background:
fr: Image de fond :

source: Colour
fr: Couleur

source: Atmosphere
fr: Atmosphère

source: Material
fr: Matériau

source: Size
fr: Taille

source: Bone:
fr: Os :

source: Camera:
fr: Caméra :

source: Control:
fr: Contrôle :

source: Borders
fr: Bordures

source: Caption
fr: Texte

source: Horiz. align.
fr: Align. horiz.

source: Center
fr: Centré

source: Vertic. align.
fr: Align. Vertic.

source: Expand Caption
fr: Texte Expand

source: Retract Caption
fr: Texte Retract

source: Export Options
fr: Options d'export

source: Scale
fr: Echelle

source: Data in subfolder
fr: Données dans un sous dossier

source: Split submeshes into meshes
fr: Découpage des submeshes en meshes

source: Recenter created meshes
fr: Recentrer les meshes créés

source: Uniform:
fr: Uniforme :

source: Value
fr: Valeur

source: Geometry:
fr: Géométrie :

source: Light:
fr: Source lumineuse :

source: Intensities
fr: Intensités

source: Point Light
fr: Source ponctuelle

source: Attenuation
fr: Atténuation

source: Spot Light
fr: Source projecteur

source: Inner cut off
fr: Angle intérieur

source: Outer cut off
fr: Angle extérieur

source: Exponent
fr: Exposant

source: Shadow:
fr: Ombres :

source: Enable Shadows
fr: Activer les ombres

source: None
fr: Aucune

source: PCF Filter Size
fr: Taille filtre PCF

source: PCF Sample Count
fr: Nb. échantillons PCF

source: Min. Variance
fr: Variance Min.

source: Light Bleeding Reduction
fr: Réduction du Light Bleeding

source: Volumetric Steps
fr: Volumétrique, étapes

source: Volumetric Scattering Factor
fr: Volumétrique, facteur de diffusion

source: Global Illumination
fr: Illumination Globale

source: GI Type
fr: Type de GI

source: LPV (Geometry)
fr: LPV (Géometries)

source: Layered LPV (Geometry)
fr: Layered LPV (Géometries)

source: Intensity
fr: Intensité

source: Max. Radius
fr: Rayon Max.

source: Sample Count
fr: Nb. échantillons

source: Texel Area Mod.
fr: Mod. aire de texel

source: Material:
fr: Matériau :

source: Scene Node:
fr: Noeud de scène :

source: Static Scene Node:
fr: Noeud de scène statique :

source: Overlay:
fr: Incrustation :

source: Borders Size
fr: Dimensions bordures

source: Borders Material
fr: Matériau bordures

source: Borders Inner UV
fr: UV bordure interne

source: Borders Outer UV
fr: UV bordure externe

source: Borders Position
fr: Position bordures

source: Internal
fr: Interne

source: Middle
fr: Milieu

source: External
fr: Externe

source: Text
fr: Texte

source: Font
fr: Police

source: Wrapping
fr: Encapsulation

source: Letter
fr: Lettre

source: Word
fr: Mot

source: Line spacing
fr: Espacement des lignes

source: Own height
fr: Hauteur propre

source: Max lines height
fr: Hauteur max des lignes

source: Max fonts height
fr: Hauteur max de la police

source: Texture mapping
fr: Application texture

source: No Blend
fr: Aucun

source: Additive
fr: Additif

source: Multiplicative
fr: Multiplicatif

source: Interpolative
fr: Interpolatif

source: One
fr: Un

source: Repeat
fr: Répété

source: Never
fr: Jamais

source: Less
fr: Inférieur

source: Equal
fr: 2gal

source: Less Equal
fr: Inférieur ou égal

source: Greater
fr: Supérieur

source: Not Equal
fr: Différent

source: Greater Equal
fr: Supérieur ou égal

source: Always
fr: Toujours

source: Enabled
fr: Activé

source: Pass:
fr: Passe :

source: View Shaders...
fr: Visualiser shaders...

source: SSAO Configuration
fr: Configuration SSAO

source: Render Target:
fr: Cible de rendu :

source: Window
fr: Fenêtre

source: Debug View
fr: Vue Débogage

source: Render Window:
fr: Fenêtre de rendu :

source: Debug overlays
fr: Incrustations Débogage

source: Scene:
fr: Scène :

source: Ambient light
fr: Eclairage ambiant

source: Indirect Attenuation
fr: Atténuation Indirecte

source: Fog
fr: Brouillard

source: Linear
fr: Linéaire

source: Exponential
fr: Exponentiel

source: Squared Exponential
fr: Exponentiel au carré

source: Density
fr: DensitéIntensité

source: Enable VCT
fr: Activer le VCT

source: Conservative Rasterization
fr: Rastérisation Conservative

source: Temporal Smoothing
fr: Lissage Temporel

source: Secondary Bounce
fr: Second Rebond

source: Num. Cones
fr: Nb. Cônes

source: Max. Distance
fr: Distance Max.

source: Ray Step Size
fr: Taille Pas Rayon

source: Voxel Size
fr: Taille Voxel

source: Skeleton Animation:
fr: Animations Squelette :

source: Node:
fr: Noeud :

source: Skeleton:
fr: Squelette :

source: Enable SSAO
fr: Activer le SSAO

source: High Quality
fr: Haute Qualité

source: Normals Buffer
fr: Tampon de Normales

source: Radius
fr: Rayon

source: Samples
fr: Echantillons

source: Edge Sharpness
fr: Finesse Bords

source: High Quality Blur
fr: Flou Haute Qualité

source: Blur Step Size
fr: Taille Pas Flou

source: Blur Radius
fr: Rayon Flou

source: Bend Step Count
fr: Nb. Pas Bend

source: Bend Step Size
fr: Taille Pas Bend

source: Background Material
fr: Matériau d'arrière plan

source: Foreground Material
fr: Matériau de premier plan

source: Text Material
fr: Matériau de texte

source: Highlighted Bg Mat.
fr: Mat. d'a. p. highlight

source: Highlighted Fg Mat.
fr: Mat. de p. p. highlight

source: Highlighted Text Mat.
fr: Mat. de texte highlight

source: Pushed Bg Mat.
fr: Mat. d'a. p. push

source: Pushed Fg Mat.
fr: Mat. de p. p. push

source: Pushed Text Mat.
fr: Mat. de texte push

source: Disabled Bg Mat.
fr: Mat. d'a. p. désactivé

source: Disabled Fg Mat.
fr: Mat. de p. p. désactivé

source: Disabled Text Mat.
fr: Mat. de texte désactivé

source: Submesh:
fr: Sous-maillage :

source: Topology
fr: Topologie

source: Point List
fr: Liste Points

source: Line List
fr: Liste Lignes

source: Line Strip
fr: Bande Lignes

source: Triangle List
fr: Liste Triangles

source: Triangle Strip
fr: Bande Triangles

source: Triangle Fan
fr: Eventail Triangles

source: Line List With Adjacency
fr: Liste Lignes Avec Adjacence

source: Line Strip With Adjacency
fr: Bande Lignes Avec Adjacence

source: Triangle List With Adjacency
fr: Liste Triangles Avec Adjacence

source: Triangle Strip With Adjacency
fr: Bande Triangles Avec Adjacence

source: Patch List
fr: Liste Patches

source: Map
fr: Texture

source: Component
fr: Composant

source: Transform
fr: Transformation

source: UV Translate
fr: Translation UV

source: UV Rotate
fr: Rotation UV

source: UV Scale
fr: Echelle UV

source: Translate
fr: Translation

source: Rotate
fr: Rotation

source: Exposure
fr: Exposition

source: Collapse all
fr: Tout Réduire

source: Collapse all the nodes of the tree
fr: Réduit tous les noeuds de l'arbre

source: Expand all
fr: Tout Développer

source: Expands all the nodes of the tree
fr: Développe tous les noeuds de l'arbre

source: Delete
fr: Supprimer

source: View shaders...
fr: Visualiser shaders...

source: Near
fr: Proche

source: Far
fr: Eloigné

source: FOV Y
fr: Ouverture verticale

source: Root
fr: Racine

source: Programs
fr: Programmes

source: &Quit CTRL+Q
fr: &Quitter CTRL+Q

source: Use GLSL to display shaders
fr: Afficher les shaders en GLSL

source: Use HLSL to display shaders
fr: Afficher les shaders en HLSL

source: Use SPIR-V to display shaders
fr: Afficher les shaders en SPIR-V

source: &Edit preferences ... CTRL+E
fr: &Préférences... CTRL+E

source: Properties
fr: Propriétés

source: Open file
fr: Ouvrir un fichier

source: Any file (*)|*
fr: Tous les fichiers (*)|*

source: Save file
fr: Sauvergarder fichier

source: Displays this help.
fr: Affiche cette aide.

source: Specifies the configuration file.
fr: Spécifie le fichier de configuration.

source: Defines log level (from 0=trace to 4=error).
fr: Définit le niveau de logging (depuis 0=trace à 4=erreurs).

source: Enables rendering API validation.
fr: Active la validation de l'API de rendu.

source: Sets the rendering to synchronous (render loop is user triggered).
fr: Définit le rendu comme synchrone (la boucle de rendu est gérée par l'utilisateur)

source: Disables FPS limit (has no effect if '
fr: Désactive la limite de FPS (n'a pas d'effet si l'option '

source: ' option is specified).
fr: ' est spécifiée).

source: Defines wanted FPS (has no effect if '
fr: Dé

source: The index of the wanted Vulkan physical device.
fr: L'indice du périphérique physique Vulkan voulu.

source: Disable update optimisations.
fr: Désactive les optimisations de mise à jour.

source: Disable full random in random buffer.
fr: Désactive l'aléatoire dans le random buffer.

source: The maximum material images size.
fr: Les dimensions maximales des images de matériau.

source: The initial scene file.
fr: Fichier de scène initial.

source: Defines the renderer to
fr: Définit l'API de rendu à

source: Problem occured while initialising Castor3D.
fr: Un problème est apparu lors de l'initialisation de Castor3D.

source: Look at CastorViewer.log for more details
fr: Consultez CastorViewer.log pour plus de détails

source: Loading language
fr: Chargement de la langue

source: Initialising Castor3D
fr: Initialisation de Castor3D

source: Loading plug-ins
fr: Chargement des plug-ins

source: Loading images
fr: Chargement des images

source: Pass
fr: Passe

source: Texture Unit
fr: Unité de texture

source: Failure on:
fr: Echec sur :

source: Supported Video files
fr: Fichiers vidéo supportés

source: Please choose a video file name
fr: Choisissez un nom de fichier vidéo

source: Can't start recording file
fr: Impossible de démarrer l'enregistrement

source: Could not deduce output format
fr: Impossible de déduire le format de sortie

source: Could not find codec
fr: Le codec est introuvable

source: Could not find format context
fr: Le codec pour le format demandé est introuvable

source: Could not allocate stream
fr: Impossible d'allouer le flux

source: Could not allocate encoded video frame
fr: Impossible d'allouer la frame vidéo encodée

source: Could not allocate video codec context
fr: Impossible d'allouer le contexte du codec vidéo

source: Could not initialise conversion context
fr: Impossible d'initialiser le contexte de conversion

source: Could not open file
fr: Impossible d'ouvrir le fichier

source: - Select renderer
fr: - Choisissez un renderer

source: Select your renderer in the list below
fr: Choisir l'API de rendu dans la liste ci-dessous

source: OK
fr: Valider

source: Global GUI Styles
fr: Style GUI globaux

source: Global GUI Controls
fr: Contrôles GUI globaux

source: Background
fr: Fond

source: Render Targets
fr: Cibles de rendu

source: Cameras
fr: Caméras

source: Light Sources
fr: Sources lumineuses

source: Scene Nodes
fr: Noeuds de scène

source: Materials
fr: Matériaux

source: Animated Object Groups
fr: Groupes d'objets animés

source: Overlays
fr: Incrustations

source: Scene GUI Styles
fr: Styles GUI de scène

source: Scene GUI Controls
fr: Contrôles GUI de scène

source: Submesh
fr: Sous-maillage

source: Based on Castor3D
fr: Basé sur Castor3D

source: DragonJoker, All rights shared
fr: DragonJoker, tous droits partagés

source: Tree
fr: Arbre
